// Задача 8: Напишите программу, которая на вход принимает число (N), 
// а на выходе показывает все чётные числа от 1 до N.

Console.Clear();
Console.WriteLine("Программа отображает все четные числа от 1 до заданного числа.");
Console.Write("Введите число: ");
int N = Convert.ToInt32(Console.ReadLine());
if (-1 <= N <=2)

четность; счетчик; шаг +2;